README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2023-08-28 Пн 07:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>README</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">README</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfd976b0">1. Содержание</a>
<ul>
<li><a href="#org8fe2c2f">1.1. Настройка <code>.bash_profile</code></a></li>
<li><a href="#org752f3ef">1.2. Перечень загружаемых пакетов из репозитория melpa</a></li>
<li><a href="#org9644b73">1.3. Перечень файлов проекта</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd976b0" class="outline-2">
<h2 id="orgfd976b0"><span class="section-number-2">1.</span> Содержание</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8fe2c2f" class="outline-3">
<h3 id="org8fe2c2f"><span class="section-number-3">1.1.</span> Настройка <code>.bash_profile</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #00d3d0;">UNAME_N</span>=<span style="color: #79a8ff;">"N142013"</span>

<span style="color: #b6a0ff;">if</span> [[ <span style="color: #79a8ff;">"N133905"</span> == ${<span style="color: #00d3d0;">UNAME_N</span>} ]]
<span style="color: #b6a0ff;">then</span>
    <span style="color: #00d3d0;">SBCL_HOME</span>=<span style="color: #79a8ff;">"//n133905/home/_namatv/PRG//SBCL/2.2.1-msi"</span>
    <span style="color: #00d3d0;">PATH</span>=<span style="color: #79a8ff;">"${PATH}:${SBCL_HOME}"</span>
<span style="color: #b6a0ff;">elif</span> [[ <span style="color: #79a8ff;">"N142013"</span> == ${<span style="color: #00d3d0;">UNAME_N</span>} ]]
<span style="color: #b6a0ff;">then</span>
<span style="color: #a8a8a8;">#    </span><span style="color: #a8a8a8;">SBCL_HOME="D:/home/_namatv/PRG/SBCL/2.2.1-msi"</span>
<span style="color: #a8a8a8;">#    </span><span style="color: #a8a8a8;">PATH="${PATH}:/d/home/_namatv/PRG/SBCL/2.2.1-msi"</span>
<span style="color: #a8a8a8;">#    </span><span style="color: #a8a8a8;">SBCL_HOME="D:/home/_namatv/PRG/SBCL/2.3.0-msi"</span>
<span style="color: #a8a8a8;">#    </span><span style="color: #a8a8a8;">PATH="${PATH}:/d/home/_namatv/PRG/SBCL/2.3.0-msi"</span>
    <span style="color: #00d3d0;">SBCL_HOME</span>=<span style="color: #79a8ff;">"D:/home/_namatv/PRG/SBCL/2.3.2-msi"</span>
    <span style="color: #00d3d0;">PATH</span>=<span style="color: #79a8ff;">"${PATH}:/d/home/_namatv/PRG/SBCL/2.3.2-msi"</span>
<span style="color: #b6a0ff;">fi</span>

<span style="color: #f78fe7;">export</span> SBCL_HOME
<span style="color: #f78fe7;">export</span> PATH

<span style="color: #f78fe7;">echo</span> .bash_profile <span style="color: #00d3d0;">SBCL_HOME</span>=${<span style="color: #00d3d0;">SBCL_HOME</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-org752f3ef" class="outline-3">
<h3 id="org752f3ef"><span class="section-number-3">1.2.</span> Перечень загружаемых пакетов из репозитория melpa</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">deadgrep</td>
</tr>

<tr>
<td class="org-left">color-theme-sanityinc-tomorrow</td>
</tr>

<tr>
<td class="org-left">slime</td>
</tr>

<tr>
<td class="org-left">cdlatex</td>
</tr>

<tr>
<td class="org-left">ox-twbs</td>
</tr>

<tr>
<td class="org-left">neotree</td>
</tr>

<tr>
<td class="org-left">gnuplot</td>
</tr>

<tr>
<td class="org-left">htmlize</td>
</tr>

<tr>
<td class="org-left">auctex</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9644b73" class="outline-3">
<h3 id="org9644b73"><span class="section-number-3">1.3.</span> Перечень файлов проекта</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #f78fe7;">cd</span> ~/elisp;
<span style="color: #b6a0ff;">for</span> i<span style="color: #b6a0ff;"> in</span> <span style="color: #f78fe7;">`ls *.el`</span>
<span style="color: #b6a0ff;">do</span>
<span style="color: #f78fe7;">echo</span> [[~/elisp/${<span style="color: #00d3d0;">i</span>}]]
<span style="color: #b6a0ff;">done</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#1044;&#1072;&#1090;&#1072;: 2023-08-28 Пн 00:00</p>
<p class="date">Created: 2023-08-28 Пн 07:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
